//
//  Constants.swift
//  IOS-DTEKSlotMachine
//
//  Created by Никита Порошин on 17.07.2024.
//

import Foundation

struct K{
    //MARK: - SECTION OF TEXT DEPENDING ON LIGHT
    static let electricityOn:[String] = ["Нарешті є світло!",
                                         "Час підзаряджати павербанки",
                                         "Світло має бути!",
                                         "Світло є!Можна йти їсти",
                                         "ДТЕК зараз гарантує електроенергію",
                                         "Світло ввімкнене!",
                                         "Є світло!Став скоріш усе на підзарядку!",
                                         "Світло повернулося!",
                                         "Світло є!Нумо грати в ігри!",
                                         "Світло є!Швиденько ставимо усе на підзарядку",
                                         "Світло ввімкнене! А тепер біжимо заряджати все, що можемо!"]
    static let electricityPossible:[String] = ["Світло може бути... або й не бути.",
                                               "Життя у сірій зоні: може світло ввімкнуть, а може ні...",
                                               "Світло на паузі: заряджаємо все і тримаємо кулаки!",
                                               "У сірій зоні електрики: підготовка до марафону свічок триває.",
                                               "Світло на лезі ножа – тримаємо зарядні пристрої напоготові.",
                                               "Світло в режимі «можливо»",
                                               "Світло в невизначеності: чи то ввімкнеться, чи то вже ні.",
                                               "Світло у стилі 'можливо'",
                                               "Сіре світло –  готуємося до несподіванок.",
                                               "Тільки Бог знає,є світло, чи ні..."]
    static let noElectricity:[String] = [
                                         "Світла немає, зате є час для роздумів про сенс життя... і свічки.",
                                        "Романтика по-українськи - бути без світла",
                                         "Світло зникло, зате яка економія на електриці!",
                                         "Темна зона – найкращий час для тренування нічного зору.",
                                         "Світла немає, зате є безмежні можливості для гри в хованки.",
                                         "Темрява – новий тренд! Світло лише для слабаків.",
                                         "Без світла, але з надією – от як ми тепер живемо.",
                                         "Темрява: коли кожна лампочка здається реліквією.",
                                         "Світла немає, зате яка прекрасна тиша без холодильника!",
                                         "Темрява: коли нарешті можна розповісти усі страшні історії.",
                                         "Світла немає!.",
                                         "Світла немає.Настрою теж...",
                                         "Діставай генератор!",
                                        "Темна зона,варто відпочити"
    ]
    
    
    
    //MARK: - IMAGES CONSTANTS
    static let noLightImage: String = Model.images[2].description
    static let possibleLightImage:String = Model.images[1].description
    static let lightOnImage:String = Model.images[0].description
    
    
    //MARK: - SOUNDS CONSTANTS
    static let lightOnSound:String = "lightsAreOn"
    static let spinSound:String = "spinSound"
    static let possibleLightSound:String = "possibleLight"
    static let buttonPressedSound:String = "buttonPressed"
    static let noLightSound:String = "noLight"
    
}
